---
title: ThermalProperties
classe: Autodesk.Revit.DB.ThermalProperties
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ThermalProperties

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Absorptance { get; set; }` | `thermalProperties.Absorptance` | Double |
| `Double HeatTransferCoefficient { get; }` | `thermalProperties.HeatTransferCoefficient` | Double |
| `Boolean IsValidObject { get; }` | `thermalProperties.IsValidObject` | Boolean |
| `Int32 Roughness { get; set; }` | `thermalProperties.Roughness` | Int32 |
| `Double ThermalMass { get; }` | `thermalProperties.ThermalMass` | Double |
| `Double ThermalResistance { get; }` | `thermalProperties.ThermalResistance` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```